src/cf/Reports/ПланированиеПродажКвартальное_обои.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>ПланированиеПродажКвартальное_обои</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.вогДизайныНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогНоменклатурныеПозиции</v8:Type>
				<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектовИерархия</v8:Type>
				<v8:Type>cfg:CatalogRef.CRM_ТипыОтношений</v8:Type>
				<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
				<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.CRM_Отрасли</v8:Type>
				<v8:Type>cfg:CatalogRef.УдалитьCRM_ТипыОтношений</v8:Type>
				<v8:Type>cfg:CatalogRef.вогРынки</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСклоненияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимоеСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/Reports/ПланированиеПродажКвартальное_обои/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	ТекПользователь = Пользователи.ТекущийПользователь();
	ДТН = Справочники.РолиИсполнителей.НайтиПоКоду("000000003");
	ГенДир  = Справочники.РолиИсполнителей.НайтиПоКоду("000000004");  
	ФинДир = Справочники.РолиИсполнителей.НайтиПоКоду("000000009");   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Пользователи.ТекущийПользователь());
	Роли = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РольИсполнителя");
	// +++ VOG Кулаков П.Л. 23.03.2021
	ЕстьДТН = Роли.Найти(ДТН) <> Неопределено;
	ЕстьГенДир = Роли.Найти(ГенДир) <> Неопределено;
	естьФинДир = роли.Найти(ФинДир) <> Неопределено;
	
	
	УстановитьПривилегированныйРежим(Истина);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подчиненные",Новый Массив(ПараметрыСеанса.вогПодчиненныеСотрудники));
	УстановитьПривилегированныйРежим(Ложь);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПолныеПрава",РольДоступна("ПолныеПрава") ИЛИ ЕстьДТН ИЛИ ЕстьГенДир ИЛИ естьФинДир);
	// --- VOG Кулаков П.Л.
	
	
	ВариантыОпросов = Новый Массив;
	ВариантыОпросов.Добавить(ПланыВидовХарактеристик.вогВариантыОпросов.ПолучитьСсылку(Новый УникальныйИдентификатор("e6f9dcee-5153-11ea-87ff-005056bc3fe8")));
	ВариантыОпросов.Добавить(ПланыВидовХарактеристик.вогВариантыОпросов.ПолучитьСсылку(Новый УникальныйИдентификатор("00a82227-cd9b-11ea-8f2a-005056bcd3e3")));
	ВариантыОпросов.Добавить(ПланыВидовХарактеристик.вогВариантыОпросов.ПолучитьСсылку(Новый УникальныйИдентификатор("a060ef76-b28b-11e9-9b11-005056bcd3e3")));
	ВариантыОпросов.Добавить(ПланыВидовХарактеристик.вогВариантыОпросов.ПолучитьСсылку(Новый УникальныйИдентификатор("f5022f7e-b81e-11e8-a684-005056bc3fe8")));
	ВариантОпросаСписокSKU = ПланыВидовХарактеристик.вогВариантыОпросов.ПолучитьСсылку(Новый УникальныйИдентификатор("4305c4d7-c743-11ea-8f2a-005056bcd3e3"));
	КлассификаторКоличествоСтендов = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("1714096b-b20e-11e9-9b11-005056bcd3e3"));
	КлассификаторФорматТРТ = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("47b0ee76-ada2-11e7-80ce-08606e7382bc"));
	КлассификаторСтатусТРТ = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("dcdbe20f-9a73-11e8-89fa-005056bc3fe8"));
	КлассифкаторКоличествоSKU = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("5af63fbb-d6c6-11e8-a684-005056bc3fe8"));	
	КлассифкаторКоличествоSKUВОГ = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("db18bcf8-c743-11ea-8f2a-005056bcd3e3"));	
	Значение053 = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("227ad8da-c744-11ea-8f2a-005056bcd3e3"));
	Значение106 = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("1346f0b9-c744-11ea-8f2a-005056bcd3e3"));
	Размер_106 = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("768685fc-d6c6-11e8-a684-005056bc3fe8"));
	Размер_053 = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("bfec323c-d6c6-11e8-a684-005056bc3fe8"));
	СтатусТТЗакрыта = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af3-9a74-11e8-89fa-005056bc3fe8"));
	СтатусТТЗакрыта = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af3-9a74-11e8-89fa-005056bc3fe8"));
	КатегорияТТ = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("ca87c1d0-75a5-11ea-87ff-005056bc3fe8")).Владелец;
	ПараметрМест = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор("4767d0c1-b28c-11e9-9b11-005056bcd3e3"));
	ПараметрРазмер = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор("2e0ee1db-b28c-11e9-9b11-005056bcd3e3"));
	ПараметрРоссия = Справочники.вогНаселенныеПункты.ПолучитьСсылку(Новый УникальныйИдентификатор("9f590895-f596-11e9-8661-005056bcd3e3"));
	СтатусАКБ = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("f84779ae-9a73-11e8-89fa-005056bc3fe8")); 
	СтатусНАКБ = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af2-9a74-11e8-89fa-005056bc3fe8")); 
	СтатусНовая = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("047f780f-8b44-11e9-9b11-005056bcd3e3")); 
	СтатусЗакрыт = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af3-9a74-11e8-89fa-005056bc3fe8")); 
	СписокDIY = Новый СписокЗначений;
	СписокDIY.Добавить(Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("4fc40649-ada2-11e7-80ce-08606e7382bc")));
	СписокDIY.Добавить(Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("64a60c68-06d3-11eb-8f2a-005056bcd3e3")));
	СписокDIY.Добавить(Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("6cac4f07-06d3-11eb-8f2a-005056bcd3e3")));
	
	ПараметрСпец = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("5d36cbb9-ada2-11e7-80ce-08606e7382bc"));
	ПараметрУнив = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("125c5f18-d29b-11e8-a684-005056bc3fe8"));
	
	ПериодПланирования = Дата(Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодПланирования")).Значение);
	ДатаОтчета = Дата(Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета")).Значение);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлассифкаторКоличествоSKU", КлассифкаторКоличествоSKU);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлассифкаторКоличествоSKU_ВОГ", КлассифкаторКоличествоSKUВОГ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Значение053", Значение053);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Значение106", Значение106);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Размер_053", Размер_053);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Размер_106", Размер_106);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КатегорияТТклассификатор",КатегорияТТ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторФорматТРТ", КлассификаторФорматТРТ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторСтатусТТ", КлассификаторСтатусТРТ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтатусТТЗакрыта",СтатусТТЗакрыта );
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("DIY", СписокDIY);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Спец", ПараметрСпец);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Унив", ПараметрУнив);
	//УстановитьПривилегированныйРежим(Истина);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подчиненные",Новый Массив(ПараметрыСеанса.вогПодчиненныеСотрудники));
	//УстановитьПривилегированныйРежим(Ложь);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПолныеПрава",РольДоступна("ПолныеПрава"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СценарийГод",Справочники.вогСценарииПланирования.ПланНаГод); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияСценарияГод",Справочники.вогВерсииСценариевПланирования.НайтиПоНаименованию("Основная",Истина,,Справочники.вогСценарииПланирования.ПланНаГод)); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СценарийКвартал",Справочники.вогСценарииПланирования.ПланНаКвартал); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияСценарияКвартал",Справочники.вогВерсииСценариевПланирования.НайтиПоНаименованию("Основная",Истина,,Справочники.вогСценарииПланирования.ПланНаКвартал)); 
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПланированияГод",НачалоГода(ПериодПланирования)); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало3Мес",ДобавитьМесяц(НачалоМесяца(ДатаОтчета),-3)); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало6Мес",ДобавитьМесяц(НачалоМесяца(ДатаОтчета),-6)); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоКварталаПрошлогоГода",НачалоКвартала(ДобавитьМесяц(ПериодПланирования,-12))); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецКварталаПрошлогоГода",КонецКвартала(ДобавитьМесяц(ПериодПланирования,-12))); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоТекущегоГода",НачалоГода(ДатаОтчета));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПрошлогоГода",НачалоГода(ДобавитьМесяц(ДатаОтчета,-12)));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПрошлогоГода",КонецКвартала(ДобавитьМесяц(ПериодПланирования,-12)));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Конец3МесПолных",КонецМесяца(ДобавитьМесяц(ДатаОтчета,-1))); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецТекущегоГода",КонецМесяца(ДобавитьМесяц(ДатаОтчета,-1)));
	
	// +++ VOG Кулаков П.Л. 23.06.2021 DEV-678
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПродажТекущийГод",ДатаОтчета); 
	// --- VOG Кулаков П.Л.
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПланаНамесяц",НачалоМесяца(ДатаОтчета)); 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СценарийПланированияНаМесяц",Справочники.вогСценарииПланирования.ПланНаМесяцПоКлиентам); 
	
	
	ТекущаяДата 						= ДатаОтчета;
	ТекущийКвартал 						= Цел((Месяц(ДатаОтчета) - 1) / 3) + 1;
	
	Для каждого СтрокаНастройки из Настройки.Структура[0].Колонки цикл
		УстановитьЗаголовкиПолей(СтрокаНастройки, ТекущаяДата, ТекущийКвартал);
	КонецЦикла;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	
	// Создание внешнего источника данных
	ПараметрФиксацияСлева = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСлева");
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхКвартал");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьЗаголовкиПолей(СтрокаНастройки, ДатаДокумента, ТекущийКвартал)
	
	ЗаменаЗаголовковПолей(СтрокаНастройки.Выбор.Элементы,ДатаДокумента,ТекущийКвартал);
	
	Для каждого ЭлСтрук из СтрокаНастройки.Структура цикл
		УстановитьЗаголовкиПолей(ЭлСтрук,ДатаДокумента,ТекущийКвартал);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаменаЗаголовковПолей(Поля, ДатаДокумента, ТекущийКвартал)
	
	Для Каждого Поле Из Поля Цикл
		
		Если СтрНайти(Поле.Заголовок, "%Текущий год%") > 0 Тогда
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%Текущий год%", Формат(ДатаДокумента, "ДФ=yyyy"));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%Прошлый год%") > 0 Тогда
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%Прошлый год%", Формат(НачалоГода(ДатаДокумента) - 1, "ДФ=yyyy"));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%Следующий квартал%") > 0 Тогда
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%Следующий квартал%", СтрШаблон("%1 кв", ТекущийКвартал + 1));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%квартал%") > 0 Тогда
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%квартал%", СтрШаблон("%1 кв", ТекущийКвартал + 1));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%Прошлый квартал%") > 0 Тогда
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%Прошлый квартал%", СтрШаблон("%1 кв", ТекущийКвартал));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%1 месяц%") > 0 Тогда
			ДатаМесяца = ДобавитьМесяц(НачалоГода(ДатаДокумента), ТекущийКвартал * 3);
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%1 месяц%", Формат(ДатаМесяца, "ДФ=MMMM"));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%2 месяц%") > 0 Тогда
			ДатаМесяца = ДобавитьМесяц(НачалоГода(ДатаДокумента), ТекущийКвартал * 3 + 1);
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%2 месяц%", Формат(ДатаМесяца, "ДФ=MMMM"));
		КонецЕсли;
		
		Если СтрНайти(Поле.Заголовок, "%3 месяц%") > 0 Тогда
			ДатаМесяца = ДобавитьМесяц(НачалоГода(ДатаДокумента), ТекущийКвартал * 3 + 2);
			Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "%3 месяц%", Формат(ДатаМесяца, "ДФ=MMMM"));
		КонецЕсли;
		Если  ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") тогда
			ЗаменаЗаголовковПолей(Поле.Элементы,ДатаДокумента,ТекущийКвартал);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
